# 1. Data preparation

### Importing libraries

In [50]:
import numpy as np
import pandas as pd
from datetime import datetime

### Data loading

In [51]:
train_df = pd.read_csv("train.csv")
building_df = pd.read_csv("building_metadata.csv")
test_df = pd.read_csv("test.csv")
weather_train_df = pd.read_csv('weather_train.csv')
weather_test_df = pd.read_csv('weather_test.csv')
print('Data shape')
print('Train dataset:', train_df.shape)
print('Test dataset:', test_df.shape)
print('Weather train dataset:', weather_train_df.shape)
print('Weather test dataset:', weather_test_df.shape)
print('Building dataset:', building_df.shape)

Data shape
Train dataset: (20216100, 4)
Test dataset: (41697600, 4)
Weather train dataset: (139773, 9)
Weather test dataset: (277243, 9)
Building dataset: (1449, 6)

In [52]:
train_df.head()

   building_id  meter            timestamp  meter_reading
0            0      0  2016-01-01 00:00:00            0.0
1            1      0  2016-01-01 00:00:00            0.0
2            2      0  2016-01-01 00:00:00            0.0
3            3      0  2016-01-01 00:00:00            0.0
4            4      0  2016-01-01 00:00:00            0.0

### Converting timestamp column to seprate columns with date and time data for train dataset

In [53]:
train_df['datetime'] = train_df['timestamp'].astype('datetime64[ns]') 
train_df['date'] = train_df['datetime'].apply(datetime.date)
train_df['time'] = train_df['datetime'].apply(datetime.time)
print(train_df.isna().sum())

building_id      0
meter            0
timestamp        0
meter_reading    0
datetime         0
date             0
time             0
dtype: int64

In [54]:
train_df.head()

,building_id,meter,timestamp,meter_reading,datetime,date,time
0,0,0,2016-01-01 00:00:00,0.0,2016-01-01,2016-01-01,00:00:00
1,1,0,2016-01-01 00:00:00,0.0,2016-01-01,2016-01-01,00:00:00
2,2,0,2016-01-01 00:00:00,0.0,2016-01-01,2016-01-01,00:00:00
3,3,0,2016-01-01 00:00:00,0.0,2016-01-01,2016-01-01,00:00:00
4,4,0,2016-01-01 00:00:00,0.0,2016-01-01,2016-01-01,00:00:00

In [55]:
test_df.head()

   row_id  building_id  meter            timestamp
0       0            0      0  2017-01-01 00:00:00
1       1            1      0  2017-01-01 00:00:00
2       2            2      0  2017-01-01 00:00:00
3       3            3      0  2017-01-01 00:00:00
4       4            4      0  2017-01-01 00:00:00

### Converting timestamp column to seprate columns with date and time data for test dataset

In [56]:
test_df['datetime'] = test_df['timestamp'].astype('datetime64[ns]') 
test_df['date'] = test_df['datetime'].apply(datetime.date)
test_df['time'] = test_df['datetime'].apply(datetime.time)
print(test_df.isna().sum())

row_id         0
building_id    0
meter          0
timestamp      0
datetime       0
date           0
time           0
dtype: int64

In [57]:
building_df.head()

   site_id  building_id primary_use  square_feet  year_built  floor_count
0        0            0   Education         7432      2008.0          NaN
1        0            1   Education         2720      2004.0          NaN
2        0            2   Education         5376      1991.0          NaN
3        0            3   Education        23685      2002.0          NaN
4        0            4   Education       116607      1975.0          NaN

In [58]:
print(building_df.isna().sum())

site_id           0
building_id       0
primary_use       0
square_feet       0
year_built      774
floor_count    1094
dtype: int64

### Droping two columns which have a lot of NaN values. In my model I will not use this two columns as features.

In [59]:
building_df = building_df.drop(columns = 'year_built')
building_df = building_df.drop(columns = 'floor_count')
building_df

      site_id  building_id                    primary_use  square_feet
0           0            0                      Education         7432
1           0            1                      Education         2720
2           0            2                      Education         5376
3           0            3                      Education        23685
4           0            4                      Education       116607
...       ...          ...                            ...          ...
1444       15         1444  Entertainment/public assembly        19619
1445       15         1445                      Education         4298
1446       15         1446  Entertainment/public assembly        11265
1447       15         1447            Lodging/residential        29775
1448       15         1448                         Office        92271

[1449 rows x 4 columns]

In [60]:
weather_train_df.head()

,site_id,timestamp,air_temperature,cloud_coverage,dew_temperature,precip_depth_1_hr,sea_level_pressure,wind_direction,wind_speed
0,0,2016-01-01 00:00:00,25.0,6.0,20.0,NaN,1019.7,0.0,0.0
1,0,2016-01-01 01:00:00,24.4,NaN,21.1,-1.0,1020.2,70.0,1.5
2,0,2016-01-01 02:00:00,22.8,2.0,21.1,0.0,1020.2,0.0,0.0
3,0,2016-01-01 03:00:00,21.1,2.0,20.6,0.0,1020.1,0.0,0.0
4,0,2016-01-01 04:00:00,20.0,2.0,20.0,-1.0,1020.0,250.0,2.6

In [61]:
print(weather_train_df.isna().sum())

site_id                   0
timestamp                 0
air_temperature          55
cloud_coverage        69173
dew_temperature         113
precip_depth_1_hr     50289
sea_level_pressure    10618
wind_direction         6268
wind_speed              304
dtype: int64

In [62]:
weather_test_df.head()

,site_id,timestamp,air_temperature,cloud_coverage,dew_temperature,precip_depth_1_hr,sea_level_pressure,wind_direction,wind_speed
0,0,2017-01-01 00:00:00,17.8,4.0,11.7,NaN,1021.4,100.0,3.6
1,0,2017-01-01 01:00:00,17.8,2.0,12.8,0.0,1022.0,130.0,3.1
2,0,2017-01-01 02:00:00,16.1,0.0,12.8,0.0,1021.9,140.0,3.1
3,0,2017-01-01 03:00:00,17.2,0.0,13.3,0.0,1022.2,140.0,3.1
4,0,2017-01-01 04:00:00,16.7,2.0,13.3,0.0,1022.3,130.0,2.6

In [63]:
print(weather_test_df.isna().sum())

site_id                    0
timestamp                  0
air_temperature          104
cloud_coverage        140448
dew_temperature          327
precip_depth_1_hr      95588
sea_level_pressure     21265
wind_direction         12370
wind_speed               460
dtype: int64

### Converting timestamp column to seprate columns with date and time data for weather_test and weather_train dataset

In [64]:
weather_train_df['datetime'] = weather_train_df['timestamp'].astype('datetime64[ns]') 
weather_train_df['date'] = weather_train_df['datetime'].apply(datetime.date)
weather_train_df['time'] = weather_train_df['datetime'].apply(datetime.time)
weather_test_df['datetime'] = weather_test_df['timestamp'].astype('datetime64[ns]') 
weather_test_df['date'] = weather_test_df['datetime'].apply(datetime.date)
weather_test_df['time'] = weather_test_df['datetime'].apply(datetime.time)

### Filling NaN values. To fill this values I calculate median for each date and I replace the value of NaN with the corresponding days with this value

In [65]:
weather_train_df['air_temperature'] = weather_train_df['air_temperature'].fillna(weather_train_df.groupby('date')['air_temperature'].transform('median'))
weather_train_df['cloud_coverage'] = weather_train_df['cloud_coverage'].fillna(weather_train_df.groupby('date')['cloud_coverage'].transform('median'))
weather_train_df['dew_temperature'] = weather_train_df['dew_temperature'].fillna(weather_train_df.groupby('date')['dew_temperature'].transform('median'))
weather_train_df['precip_depth_1_hr'] = weather_train_df['precip_depth_1_hr'].fillna(weather_train_df.groupby('date')['precip_depth_1_hr'].transform('median'))
weather_train_df['sea_level_pressure'] = weather_train_df['sea_level_pressure'].fillna(weather_train_df.groupby('date')['sea_level_pressure'].transform('median'))
weather_train_df['wind_direction'] = weather_train_df['wind_direction'].fillna(weather_train_df.groupby('date')['wind_direction'].transform('median'))
weather_train_df['wind_speed'] = weather_train_df['wind_speed'].fillna(weather_train_df.groupby('date')['wind_speed'].transform('median'))

In [66]:
print(weather_train_df.isna().sum())

site_id               0
timestamp             0
air_temperature       0
cloud_coverage        0
dew_temperature       0
precip_depth_1_hr     0
sea_level_pressure    0
wind_direction        0
wind_speed            0
datetime              0
date                  0
time                  0
dtype: int64

In [67]:
weather_test_df['air_temperature'] = weather_test_df['air_temperature'].fillna(weather_test_df.groupby('date')['air_temperature'].transform('median'))
weather_test_df['cloud_coverage'] = weather_test_df['cloud_coverage'].fillna(weather_test_df.groupby('date')['cloud_coverage'].transform('median'))
weather_test_df['dew_temperature'] = weather_test_df['dew_temperature'].fillna(weather_test_df.groupby('date')['dew_temperature'].transform('median'))
weather_test_df['precip_depth_1_hr'] = weather_test_df['precip_depth_1_hr'].fillna(weather_test_df.groupby('date')['precip_depth_1_hr'].transform('median'))
weather_test_df['sea_level_pressure'] = weather_test_df['sea_level_pressure'].fillna(weather_test_df.groupby('date')['sea_level_pressure'].transform('median'))
weather_test_df['wind_direction'] = weather_test_df['wind_direction'].fillna(weather_test_df.groupby('date')['wind_direction'].transform('median'))
weather_test_df['wind_speed'] = weather_test_df['wind_speed'].fillna(weather_test_df.groupby('date')['wind_speed'].transform('median'))

In [68]:
print(weather_test_df.isna().sum())

site_id                 0
timestamp               0
air_temperature         0
cloud_coverage        528
dew_temperature         0
precip_depth_1_hr       0
sea_level_pressure      0
wind_direction          0
wind_speed              0
datetime                0
date                    0
time                    0
dtype: int64

In [100]:
weather_test_df = weather_test_df.fillna(0)
print(weather_test_df.isna().sum())

site_id               0
timestamp             0
air_temperature       0
cloud_coverage        0
dew_temperature       0
precip_depth_1_hr     0
sea_level_pressure    0
wind_direction        0
wind_speed            0
datetime              0
date                  0
time                  0
dtype: int64

### Saving new data to csv files

In [101]:
building_df.to_csv("building_metadata_pp.csv", index=False)
weather_train_df.to_csv('weather_train_pp.csv', index=False)
weather_test_df.to_csv('weather_test_pp.csv', index=False)
train_df.to_csv("train_pp.csv", index=False)
test_df.to_csv("test_pp.csv", index=False)